In [1]:
import seaborn as sns
from pyspark.ml import Pipeline
from pyspark.ml.feature import StringIndexer
from pyspark import SparkContext
from pyspark.sql import SQLContext # Main entry point for DataFrame and SQL functionality.

sc = SparkContext.getOrCreate()
sqlCtx = SQLContext(sc)

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/10/25 18:39:22 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
22/10/25 18:39:24 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [2]:
import pyspark
print(pyspark.__version__)

3.3.0

In [3]:
import pandas as pd
df_student = pd.read_csv('./input/student.csv')

In [4]:
df_student

     sno FirstName LASTNAME
0    one       Ram      NaN
1    two       NaN   Sharma
2  three     Shyam      NaN
3   four     Kabir      NaN
4   five       NaN    Singh

In [5]:
df_student['first_letter'] = df_student['FirstName'].str[0]

In [6]:
df_student

     sno FirstName LASTNAME first_letter
0    one       Ram      NaN            R
1    two       NaN   Sharma          NaN
2  three     Shyam      NaN            S
3   four     Kabir      NaN            K
4   five       NaN    Singh          NaN

In [7]:
from pyspark import pandas as ppd

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

In [8]:
df_student_ppd = ppd.read_csv('./input/student.csv')

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/pandas/utils.py:975: PandasAPIOnSparkAdviceWarning: If `index_col` is not specified for `read_csv`, the default index is attached which can cause additional overhead.
  warnings.warn(message, PandasAPIOnSparkAdviceWarning)

In [9]:
df_student_ppd

     sno FirstName LASTNAME
0    one       Ram     None
1    two      None   Sharma
2  three     Shyam       NA
3   four     Kabir     None
4   five        NA    Singh

df_student_ppd['first_letter'] = df_student_ppd['FirstName'].str[0] 

# In Pandas API on Spark
TypeError: 'StringMethods' object is not subscriptable

df_student_ppd['first_letter'] = df_student_ppd['FirstName'].str
TypeError: Column assignment doesn't support type StringMethods # pyspark.pandas.strings.StringMethods as shown below.

df_student_ppd['FirstName'].str
<pyspark.pandas.strings.StringMethods at 0x7f7474157520>

In [21]:
df_student_ppd['first_letter'] = df_student_ppd['FirstName'].apply(lambda x: x[0])

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/pandas/internal.py:1573: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  fields = [
/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/pandas/conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [23]:
df_student_ppd

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

     sno FirstName LASTNAME first_letter
0    one       Ram     None            R
1    two      None   Sharma            N
2  three     Shyam       NA            S
3   four     Kabir     None            K
4   five        NA    Singh            N

In [25]:
df_student_ppd['LASTNAME'] = df_student_ppd['LASTNAME'].astype(str)
# TypeError: 'NoneType' object is not subscriptable
df_student_ppd['first_letter_of_last_name'] = df_student_ppd['LASTNAME'].apply(lambda x: x[0])

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/pandas/internal.py:1573: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  fields = [
/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/pandas/conversion.py:486: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  for column, series in pdf.iteritems():

In [26]:
df_student_ppd

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

     sno FirstName LASTNAME first_letter first_letter_of_last_name
0    one       Ram     None            R                         N
1    two      None   Sharma            N                         S
2  three     Shyam       NA            S                         N
3   four     Kabir     None            K                         N
4   five        NA    Singh            N                         S